12/data/attachments/bb5fe6b39465be58.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_fdf39a80-fddd-4299-b9d4-02777f16295a</nif:username>
            <nif:friendToBeAdded>Angela_condition_Friend_74217_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>